{
  "data": [
    {
      "id": 0,
      "authorId": 0,
      "author": "Нетология. Университет интернет-профессий будущего",
      "authorAvatar": "@tools:sample/avatars",
      "content": "Привет, это новая Нетология! Когда-то Нетология начиналась с интенсивов по онлайн-маркетингу. Затем появились курсы по дизайну, разработке, аналитике и управлению. Мы растём сами и помогаем расти студентам: от новичков до уверенных профессионалов. Но самое важное остаётся с нами: мы верим, что в каждом уже есть сила, которая заставляет хотеть больше, целиться выше, бежать быстрее. Наша миссия — помочь встать на путь роста и начать цепочку перемен → http://netolo.gy/fybЗадача\nСделайте так, чтобы при клике на элемент списка открывался фрагмент с конкретным постом. Если пользователь кликнул на меню, like, share или видео, перехода быть не должно.\n\nПока фрагмент с конкретным постом будет выглядеть так, как обычный пост из списка.\n\nОперации для поста должны работать как из этого фрагмента, так и из фрагмента со списом постов.\n\nС этого фрагмента можно попасть:\n\nНа фрагмент редактирования, если нажать на кнопку «Изменить».\nНа фрагмент со списком всех постов, если нажать на кнопку «Назад» (системную).\nНа фрагмент со списком всех постов, если нажать на кнопку «Удалить».\nПротестируйте ситуацию, при которой ваш пост по высоте превышает экран. Возможно, потребуется добавить скроллируемый контейнер.\n\nПрошлая функциональность в проекте должна работать по-прежнему.\n\nВ качестве результата пришлите ссылку на ваш GitHub-проект в личном кабинете студента на сайте netology.ru.Задача\nСделайте так, чтобы при клике на элемент списка открывался фрагмент с конкретным постом. Если пользователь кликнул на меню, like, share или видео, перехода быть не должно.\n\nПока фрагмент с конкретным постом будет выглядеть так, как обычный пост из списка.\n\nОперации для поста должны работать как из этого фрагмента, так и из фрагмента со списом постов.\n\nС этого фрагмента можно попасть:\n\nНа фрагмент редактирования, если нажать на кнопку «Изменить».\nНа фрагмент со списком всех постов, если нажать на кнопку «Назад» (системную).\nНа фрагмент со списком всех постов, если нажать на кнопку «Удалить».\nПротестируйте ситуацию, при которой ваш пост по высоте превышает экран. Возможно, потребуется добавить скроллируемый контейнер.\n\nПрошлая функциональность в проекте должна работать по-прежнему.\n\nВ качестве результата пришлите ссылку на ваш GitHub-проект в личном кабинете студента на сайте ",
      "published": "2023-07-27T17:00:00.000Z",
      "coordinates": {
        "lat": 59.959001,
        "long": 30.355106
      },
      "attachment": {
        "url": "",
        "type": "IMAGE"
      },
      "datetime": "2023-07-17T12:45:00.000Z"
    }
  ]
}